app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE (lat='31.41' AND lon='31.81')  ORDER BY tweets.created_at DESC
---
  def show
    unless session[:lat] == ''
    @tweetsFinder = Tweet.where("lat=? AND lon=?",session[:lat],session[:lon])

SELECT `tweets`.* FROM `tweets` WHERE (lat='31.41' AND lon='31.81')  ORDER BY tweets.amp DESC
---
  def hot
    @tweetsFinder = Tweet.where("lat=? AND lon=?",session[:lat],session[:lon])

INSERT INTO `tweets` (`tweet`, `user_id`, `lat`, `lon`, `username`, `created_at`, `updated_at`) VALUES ('first tweet', 1, 31.2, 29.92, 'baselhashish', '2015-11-16 15:45:59', '2015-11-16 15:45:59')
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = session[:user_id]
    @tweet.lat = session[:lat]
    @tweet.lon = session[:lon]
    @tweet.username = session[:username]
    if @tweet.save

SELECT  "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tweets" SET "voters" = $1, "amp" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4  [["voters", "baselhashish"], ["amp", 2], ["updated_at", "2015-12-02 14:12:30.694188"], ["id", 1]]
---
  def amplify
    @tweet = Tweet.find(params[:id])
    session[:return_to] ||= request.referer
    if @tweet.voters == nil
      @tweet.voters = ""
    end
    if @tweet.voters.include? session[:username]
      flash[:error] = "You can only vote once."
      redirect_to session.delete(:return_to) and return
    else
    @tweet.amp += 1
    @tweet.voters << session[:username]
    end
    # Update the object
    if @tweet.update_attributes(amp)

DELETE FROM `tweets` WHERE `tweets`.`id` = 26
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 26 LIMIT 1
---
  def destroy
    tweet = Tweet.find(params[:id]).destroy