app/controllers/users_controller.rb

  def show
    @user = User.find(session[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email`, `username`, `first_name`, `last_name`, `password_digest`, `description`, `country`, `created_at`, `updated_at`) VALUES ('asdasasd@asdasdad.com', 'allcapsmotherfucker', 'testtest', 'testtestagain', '$2a$10$U74n6QFspVmhl9J7NuhUtu07Auqb2ef9FLyKih4aOBrYrRtWQcVKC', 'blah blah blah', 'Angola', '2015-12-02 13:53:56', '2015-12-02 13:53:56')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE `users` SET `description` = 'Living life and loving it, one day at a time!!', `country` = 'Egypt', `updated_at` = '2015-12-02 00:05:18' WHERE `users`.`id` = 1